Revit 2027 API
BuiltInFailures.BendFailures.NotBentSharedFamily Property
 While making curved beam type "[Type Name]" Shared Family Instances were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentSharedFamily { get; }
Public Shared ReadOnly Property NotBentSharedFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentSharedFamily {
	FailureDefinitionId^ get ();
}
static member NotBentSharedFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace